[
  {
    "text": "About DCC Our Brand Statement Our collaborative team of trusted professionals provide inclusive, innovative, high-quality patient care; nourishing empowered health decisions. Our Brand Statement Our collaborative team of trusted professionals provide inclusive, innovative, high-quality patient care; nourishing empowered health decisions. Mission & Values Our mission is simple, to provide the best quality dialysis services More The DCC Story The story begins with a single-specialty nephrology practice founded More Leadership Tunji Alausa, MD is a board-certified Nephrologist and the founder of both Kidney More DCC Cares DCC Cares is the flagship program launched by Dialysis Care Center. More About Us",
    "source": "about-us",
    "chunk_id": "about-us_chunk_1",
    "word_count": 99,
    "char_count": 708
  },
  {
    "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA About DCC Cares DCC Cares is the flagship program launched by Dialysis Care Center. It serves as a trilogy of care: care for our patients, care for our employees, and care for the communities we serve. It involves employee and patient recognition, team-building opportunities, celebrations, and regional events. Employee Recognition Patient Recognition Team-building Celebrations Regional Events Programs DCC Ambassadors DCC Ambassadors is our Employee Recognition Award. A company-wide selection process helps nominate DCC Ambassadors. We recognize the outstanding contributions of each member of our DCC Family. Learn More DCC Champions DCC Champions is our Patient Recognition Award. Through the program, Dialysis Care Center addresses the issue of missed dialysis treatments. We recognize and celebrate our patients for prioritizing their dialysis treatments each month. Learn More DCC Culture of Excellence The DCC Culture of Excellence is a unique care initiative designed to exceed our patient’s expectations by delivering high-quality, patient-centered care. The program focuses on service excellence, patient-centered care, enhanced customer service training, exceptional customer service, prioritizing team approach, and improvement of the quality of life for patients. Learn More Let's Hear From Our Team One of the best things about working at DCC is working with people who are not just co-workers but are more like family. We all have the same goal - to take the best care of our patients as best of our patients as best we can, no matter what role we play. Angela P. The most rewarding thing about working at DCC is knowing we are all a big family. It's incredible to see that I've positively impacted the lives of our patients, their loved ones, and the DCC community. Amanda M. Join DCC Family If you are interested in becoming part of the DCC Family, visit our careers page to explore the opportunities. Careers Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY",
    "source": "about-us_dcc-cares",
    "chunk_id": "about-us_dcc-cares_chunk_1",
    "word_count": 500,
    "char_count": 3272
  },
  {
    "text": "ones, and the DCC community. Amanda M. Join DCC Family If you are interested in becoming part of the DCC Family, visit our careers page to explore the opportunities. Careers Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​",
    "source": "about-us_dcc-cares",
    "chunk_id": "about-us_dcc-cares_chunk_2",
    "word_count": 168,
    "char_count": 1038
  },
  {
    "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Leadership Executive Team Management Team Executive Team Tunji Alausa, M.D. Executive Chairman & Chief Medical Officer Tunji Alausa, M.D. is a board-certified Nephrologist and the founder of both Kidney Care Center, a nephrology practice and Dialysis Care Center, a rapidly growing provider of boutique dialysis services nationwide. Dr. Alausa has created these national brands focusing on optimal care for patients with chronic kidney disease in underserved communities. He has made a remarkable contribution to these communities by creating numerous job opportunities for diverse stakeholders. Additionally, he has established a team of highly skilled professionals across the country who share his vision and mission.Dr. Alausa served as a Chief Medical Resident at Cook County Hospital, Chicago, after completing his residency in Internal Medicine. In this role, he supervised the training of several interns and residents and acted as an Attending Physician. Later, he joined Rush University Medical School as an Assistant Professor. He then moved to the Medical College of Wisconsin for his specialist training in Nephrology and Hypertension.Dr. Alausa has been recognized with multiple awards for his charitable contributions and voluntary service to those in need, which is a testament to his philanthropic spirit. He has published numerous medical papers covering a diverse range of practices. His publications have transcended basic medical research and clinical medicine and appeared in the New England Journal of Medicine. In 2007 & 2012, Dr. Tunji Alausa was named one of America’s Best Physicians. Linkedin Mohammad S. Shafi, M.D. Executive Vice-Chairman & Chief Medical Officer Mohammad S. Shafi, M.D. is a board-certified Nephrologist. He is the co-founder of Dialysis Care Center and Kidney Care Center. Both companies provide services to ensure a better life for CKD or kidney failure patients. He is recognized as a leader, owing to his expertise in nephrology, compassion for his patients, and his commitment to innovation. His insight was instrumental in launching the nation’s first Staff Enhanced Home Hemodialysis program.",
    "source": "about-us_leadership",
    "chunk_id": "about-us_leadership_chunk_1",
    "word_count": 500,
    "char_count": 3417
  },
  {
    "text": "Both companies provide services to ensure a better life for CKD or kidney failure patients. He is recognized as a leader, owing to his expertise in nephrology, compassion for his patients, and his commitment to innovation. His insight was instrumental in launching the nation’s first Staff Enhanced Home Hemodialysis program. Dr. Shafi completed his medical education at the King Edward Medical University in Lahore, Pakistan, in the year 1991. During his residency, he trained in internal medicine at Englewood Hospital, affiliated with the renowned Mount Sinai School of Medicine. He also served as the Chief Resident during his time there. In 1997, Dr. Shafi completed his fellowship training in nephrology at the University of Louisville School of Medicine. He also completed 1 Year fellowship in critical care at the University of Louisville, Kentucky. Dr. Shafi has over twenty-one years of experience in Nephrology. In addition to his nephrology practice, his particular interest lies in infection control in dialysis settings which is a significant cause of death in dialysis patients. He speaks passionately at several national and international conferences. He is firmly committed to contributing to society and is deeply committed to his charitable endeavors. Currently, he holds the position of the board’s chair at the IPAC Foundation, where he works towards promoting preventive healthcare in underprivileged regions across the globe. Linkedin Babajide Salako, M.D. Chief Executive Officer Babajide Salako, M.D. is an experienced leader with varied international experience in medicine and the business of medicine in various roles and responsibilities. He joined the Dialysis Care Center in 2014 as the Chief Executive Officer. He drives the company’s visionary plan and growth and oversees the daily dialysis business operations. Before joining DCC, he was Senior Director of Disaster Response and Business Continuity with Fresenius, where his responsibility included responding to and managing disasters as they impacted kidney patients globally. Dr. Salako’s business acumen and extraordinary vision have earned him numerous recognitions including Person of the Year from the Kidney Community Emergency Response Coalition.Dr. Salako is an Internal Medicine trained physician with an MBA from George Washington University. Linkedin Michael Mance, CPA Vice President of Financial Operations Michael Mance, CPA serves as Vice President of Financial Operations at Dialysis Care Center. He leads the Finance Team, ensures strategic growth, and drives the financial strength of the company’s future, overseeing the strategy, finance, banking, and audit relationships, capital financing, financial reporting, treasury, internal controls, accounting close, budgeting, forecasting, expense management, financial planning, tax planning, and compliance and acquisitions. Leading the DCC’s financial operations, accounting, and strategic acquisitions, Michael possesses over 30 years of experience in accounting, corporate compliance, financial reporting, and shared services with global publicly and privately held companies. Michael has completed his undergraduate studies in accounting at Illinois State University and is now a Certified Public Accountant. He believes in making a difference in his team’s careers and ensuring their success. Linkedin Monique Barnes Vice President of Education, Quality and Care Delivery Monique Barnes brings a combination of management and clinical",
    "source": "about-us_leadership",
    "chunk_id": "about-us_leadership_chunk_2",
    "word_count": 500,
    "char_count": 3492
  },
  {
    "text": "his undergraduate studies in accounting at Illinois State University and is now a Certified Public Accountant. He believes in making a difference in his team’s careers and ensuring their success. Linkedin Monique Barnes Vice President of Education, Quality and Care Delivery Monique Barnes brings a combination of management and clinical expertise with 20 years of experience in Dialysis. She oversees all areas of clinical operations, including In-Center, Home, Quality/regulatory, and the education departments of DCC. Monique believes in impacting the lives of dialysis patients by offering high-quality care and that of healthcare personnel by ensuring a safe and nurturing environment.Monique holds an MBA degree coupled with HCM and BSN, which gives her the unique expertise to find creative ways to solve problems. She is also a member of the American Nephrology Nurses Association (ANNA). Linkedin Gary Joslin Vice President of In-Center Clinical Operations Gary Joslin serves as Vice President of In-Center Clinical Operations at Dialysis Care Center, bringing with him an impressive track record in leadership and clinical expertise. Gary is proud of his 25 years of distinguished service in various medical roles within the US Army, including his time as a Combat Medical Specialist.Gary completed his studies in Business Administration at Grantham University in Missouri and graduated with honors from the US Army Academy of Health Science. He has held leadership positions in multiple dialysis organizations throughout his career, consistently demonstrating his ability to build, stabilize, and guide teams toward success. Gary’s extensive healthcare background has strengthened his abilities in clinical operations and strategic leadership. At DCC, Gary is committed to driving growth and enhancing the quality of patient care. Linkedin Michele Crnich Associate Vice President of Human Resources and Marketing/ Communications Michele Crnich is currently the Associate Vice President of Human Resources and Marketing/ Communications. She has been with Dialysis Care Center for over four years, working to build the Human Resources department, H.R. services, and the Marketing department. Michele brought a wide breadth of Human Resources and Communications experience in the Healthcare field, specifically 20-plus years focused on Skilled Nursing and Rehab facilities.Michele’s passion for working with people is apparent as she works with the team, assisting them in their professional development, consults with Managers, addresses challenges, creates processes, continually evaluates employee benefits, and focuses on maintaining a healthy, happy, professional work culture for the entire DCC team. Michele is proud to be a part of the phenomenal DCC growth and looks forward to many challenges and improvements that DCC will experience.She earned a B.S. degree in Communications with an emphasis on Public Relations. As an SHRM member, she remains current with employment law and H.R. updates. Linkedin Paul Jackson Director of Business Development Paul Jackson has successfully built a 30-year career and spent years developing Elmhurst Hospital’s occupational health network. During this time, he received a nomination from President George Bush for innovative solutions in establishing a first responder Hepatitis B vaccination program. Paul parlayed his marketing expertise into the dialysis world in 2012 and since",
    "source": "about-us_leadership",
    "chunk_id": "about-us_leadership_chunk_3",
    "word_count": 500,
    "char_count": 3436
  },
  {
    "text": "successfully built a 30-year career and spent years developing Elmhurst Hospital’s occupational health network. During this time, he received a nomination from President George Bush for innovative solutions in establishing a first responder Hepatitis B vaccination program. Paul parlayed his marketing expertise into the dialysis world in 2012 and since then has championed DCC partnerships across the country. Linkedin Lori Morrell Director of Revenue Cycle Management & Contracting Lori Morrell has over 25 years of administrative experience in the healthcare industry. She manages the ever-growing revenue cycle team of admissions, billing, accounts receivable, revenue cycle, and insurance specialists. She utilizes her passion in this role to create exceptional supervisors and managers within her revenue cycle team, who help contribute to the continued success of the revenue cycle management department. The most rewarding thing for Lori has been assisting patients in resolving complex issues and ensuring they get the best quality care in DCC. Linkedin Lanre Alausa Vice President of Value-Based and Integrated Care Lanre Alausa is currently the Vice President of Value-Based and Integrated Care for Kidney Care Center and Dialysis Care Center. He has more than 13 years of experience in the dialysis space. Lanre’s positive relationships with external partners are instrumental in the thriving business operations of both our organizations (KCC and DCC) and our partners. He is also responsible for implementing and managing the collaborative Value-Based Care programs between the Dialysis Care Center, Kidney Care Center, Government, and Private Health Plans such as The Center for Medicare and Medicaid Innovation Models (CKCC, ETC) and all other Value-Based Programs.Lanre holds an MBA degree with an emphasis in Financial Management. He is also a Healthcare Financial Management Association (HFMA) member. Linkedin Salman Azam General Counsel Salman Azam serves as General Counsel for the Dialysis Care Center. He manages all legal personnel and legal matters for the company, including all transactional work, regulatory affairs, compliance, and labor and employment issues. Before joining DCC, he was the Managing Partner of a boutique healthcare firm in Chicago that serviced various regional providers. Mr. Azam was recognized by Crain’s as a Notable General Counsel for his work with DCC and has additionally received the “Rising Star” Super Lawyer distinction by Chicago magazine for over a decade. Salman has previously held the position of President at the South Asian Bar Association of Chicago and has been featured as a TEDx speaker. Linkedin Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to",
    "source": "about-us_leadership",
    "chunk_id": "about-us_leadership_chunk_4",
    "word_count": 500,
    "char_count": 3253
  },
  {
    "text": "WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​",
    "source": "about-us_leadership",
    "chunk_id": "about-us_leadership_chunk_5",
    "word_count": 86,
    "char_count": 696
  },
  {
    "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Mission & Values In 2010, Dialysis Care Center opened its doors in Homer Glen, IL as Home Dialysis Services. From the company’s inception, we offered a unique home dialysis experience that provided Care, Convenience & Freedom for our patients.In 2012, the decision was made to expand our services, providing dialysis treatment options to our patients who we serve. As we opened our first In Center, Dialysis Care Center was born, now offering our patient choices of all three modalities- In Center dialysis, Peritoneal Dialysis and Home Hemodialysis treatments. As a physician owned and physician led company, we insist Care is at the heart of everything that we do. Dialysis Care Center has been Leading with Care from our company’s inception, and we are committed to continue indefinitely into the future. LeadingWithCare Hear From Our Leadership Tunji Alausa, MD | Chairman Muhammad S. Shafi, MD | Vice Chairman Babajide Salako, MD | Chief Executive Officer Our Mission Our mission is simple, to provide the best quality dialysis services: that our patients and caregivers deserve, that providers choose for their patients, that our staff can be proud of, and that our partners prefer for long-term returns.We believe that dialysis should make room in your life, your life shouldn’t make room in dialysis. We are dedicated to our mission in improving the lives of our patients by empowering our team, becoming part of the communities we serve, and continuous innovation. Our Core Values Exceptional ServiceOur unwavering commitment to excellence in patient services propels us to continually raise the bar, consistently exceeding expectations.InclusivityFirmly rooted in the values of equity and respect for all, we champion a diverse corporate culture that fosters inclusivity and honor.CompassionAcknowledging the profound impact of our services on patients and their families, we dedicate ourselves to providing compassionate care and supporting them on their unique journeys.IntegrityGuided by the highest moral and ethical standards, we uphold principles of integrity and honesty in",
    "source": "about-us_mission-values",
    "chunk_id": "about-us_mission-values_chunk_1",
    "word_count": 500,
    "char_count": 3361
  },
  {
    "text": "champion a diverse corporate culture that fosters inclusivity and honor.CompassionAcknowledging the profound impact of our services on patients and their families, we dedicate ourselves to providing compassionate care and supporting them on their unique journeys.IntegrityGuided by the highest moral and ethical standards, we uphold principles of integrity and honesty in every facet of our operations.TeamworkOperating seamlessly as the “DCC Family,” each member plays a pivotal role in achieving our shared mission, whether stationed in a clinic or an office.Responsibility and OwnershipWe approach our work with a sense of responsibility, taking ownership of our decisions, actions, and their ensuing outcomes.Community CollaborationOur collaborative efforts extend to serving communities, embracing diverse cultures, and actively contributing to the cultivation of love and care, thereby enriching the world we live in. Our Brand Statement Our collaborative team of trusted professionals provide inclusive, innovative, high-quality patient care; nourishing empowered health decisions. DCC Careers Join the DCC Family and make a difference in thousands of lives.Learn More DCC Cares Take a closer look at our flagship program encompassed around the trinity of care for patients, staff and the communities.Learn More DCC Partners Get more information about the partner relationships at DCCLearn More Our Brand Statement Our collaborative team of trusted professionals provide inclusive, innovative, high-quality patient care; nourishing empowered health decisions. Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​",
    "source": "about-us_mission-values",
    "chunk_id": "about-us_mission-values_chunk_2",
    "word_count": 352,
    "char_count": 2431
  },
  {
    "text": "The Origin The story begins with a single-specialty nephrology practice founded by Tunji Alausa, MD, our current executive Chairman. The practice was initially named \"Germane Nephrology\" and later became \"Kidney Care Center.\" The first office was located in Joliet.",
    "source": "about-us_the-dcc-story",
    "chunk_id": "about-us_the-dcc-story_chunk_1",
    "word_count": 39,
    "char_count": 265
  },
  {
    "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Contact Us Admissions If you would like help in locating a DCC clinic, or would like to become a DCC patient please speak with our admissions specialist at 844-466-3436 DCC Compliance Hotline We’re here to answer any questions and to address any concerns you may have. For all kinds of feedback, complaints, general comments, payment/insurance information, please call 855.920.2100 Career Queries We are always looking for bright and passionate people to join our team. To learn more about working at Dialysis Care Center and to search open positions, please visit our careers page. Marketing and Media For all marketing and media related queries, please contact our marketing team at marketing@dccdialysis.com Partner with us For more information on becoming a DCC partner, please visit out partners page. DCC Customer Care helpline Our dedicated team members are available to answer your questions and address your concerns. Call us at (800) 985 7660 for support Send us a Message Dialysis Care Center is committed to protecting and respecting your privacy, and we’ll only use your personal information to administer your account and to provide the products and services you requested from us. From time to time, we would like to contact you about our products and services, as well as other content that may be of interest to you. Send Massage [contact-form-7 id=\"55\" title=\"Contact Form\"] Corporate Office Address15801 South Bell Road, Homer Glen, IL 60491 General Inquiriesinfo@dccdialysis.com Phone+1-844-466-3436 Fax+1-708-645-1001 Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436",
    "source": "contact-us",
    "chunk_id": "contact-us_chunk_1",
    "word_count": 500,
    "char_count": 3219
  },
  {
    "text": "NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​",
    "source": "contact-us",
    "chunk_id": "contact-us_chunk_2",
    "word_count": 104,
    "char_count": 750
  },
  {
    "text": "DIALYSIS CENTER LOCATIONS Based on data from https://dccdialysis.com/search-by-city/ ================================================== DIALYSIS CARE CENTER BEVERLY Address: 10801 S. Western Ave, Suite 100, Chicago, IL 60643 Phone: 708-741-1606 Fax: 708-741-1609 Services: In-Center Hemodialysis State: ILLINOIS ================================================== DIALYSIS CARE CENTER BROOKSVILLE Address: 7179 S Broad St, Brooksville, FL, 34601 Phone: 352-631-7300 Fax: 352-631-7301 Services: In-Center Hemodialysis State: FLORIDA ================================================== DIALYSIS CARE CENTER CAMP HILL HOME Address: 205 Grandview Avenue, Camp Hill, PA, 17011 Phone: 717-910-1400 Fax: 717-910-1401 Services: Home Hemodialysis, Peritoneal Dialysis State: PENNSYLVANIA ================================================== DIALYSIS CARE CENTER CHAMBERSBURG Address: 20 Parkwood Dr., Suite 1, Chambersburg, PA 17201 Phone: 717-401-2060 Fax: 717-401-2061 Services: Peritoneal Dialysis, Home Hemodialysis, In-Center Hemodialysis State: PENNSYLVANIA ================================================== DIALYSIS CARE CENTER CLEVELAND Address: 905 Clingan Ridge Drive Northwest, Cleveland, TN, 37312 Phone: 423-476-6166 Fax: 423-559-9428 Services: Peritoneal Dialysis, Home Hemodialysis, In-Center Hemodialysis State: TENNESSEE ================================================== Note: This list contains the locations that were successfully extracted. There appear to be more locations available on the website (indicated by pagination showing \"12345678910Next\"), but the website uses dynamic loading which makes it difficult to scrape all locations in a single request. The locations shown here represent the first page of results. Contact Information: - General Admissions: 844-466-3436 - Alternative Contact: 309-808-4352 - Email: admissions@dccdialysis.com",
    "source": "dialysis-centers-locations",
    "chunk_id": "dialysis-centers-locations_chunk_1",
    "word_count": 201,
    "char_count": 1858
  },
  {
    "text": "Walk for Kidneys 2025 View Album #TeamCare Walk for Kidneys 2025 View Album Home Dialysis Services Care. Convenience. Freedom. Stay close to loved ones by choosing Home Dialysis. Explore Locations Find a Dialysis Care CenterNear You Find a Center #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 Leading with Care In 2010, Dialysis Care Center opened its doors in Homer Glen, IL as Home Dialysis Services. From the company’s inception, we offered a unique home dialysis experience that provided Care, Convenience & Freedom for our patients.In 2012, the decision was made to expand our services, providing dialysis treatment options to our patients who we serve. As we opened our first In Center, Dialysis Care Center was born, now offering our patient choices of all three modalities- In Center dialysis, Peritoneal Dialysis and Home Hemodialysis treatments. As a physician owned and physician led company, we insist Care is at the heart of everything that we do. Dialysis Care Center has been Leading with Care from our company’s inception, and we are committed to continue indefinitely into the future. In 2010, Dialysis Care Center opened its doors in Homer Glen, IL as Home Dialysis Services. From the company’s inception, we offered a unique home dialysis experience that provided Care, Convenience & Freedom for our patients. #HappeningNow #HappeningNow FeatureRead More about Kidney Transplant 101: What You Need to Know Campaign 10:00 AM #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 Find a Dialysis Care Center Enter your Location Destination missing or invalid Search Try a detailed search Locate and request treatment at one of our dialysis care centers. Find a Dialysis Center Enter your Location Destination missing or invalid Search Try a detailed search Locate and request treatment at one of our dialysis centers. Treatments Kidney Diet & Nutrition DCC Cares The DCC Connection Read Latest Newsletter 2025 Dialysis News & Blogs Kidney Transplant 101: What You Need to KnowJune 12, 2025 National Nutrition Month 2025 – How Food Connects UsMarch 06, 2025 Heartfelt Thanks to DCC Ooltewah – A Story of Care & DedicationDecember 30, 2024 View All News & Blogs View All News The DCC Connection Read March 2025 Newsletter Dialysis News & Blogs Festive Feasting: How to Make Your Holiday Menu Kidney-FriendlyDecember 02, 2022 Back to the Basics of the Renal DietSeptember 28, 2022 Controlling Your Phosphorus LevelsSeptember 28, 2022 View All News & BLogs View All News Connect with us Connect with us​ DialysisCareCenter DialysisCareCenter DialysisCareCenter Dialysis Care Center – Leading with Care",
    "source": "home",
    "chunk_id": "home_chunk_1",
    "word_count": 426,
    "char_count": 2744
  },
  {
    "text": "Treatments Starting on Dialysis ​ When you’re preparing for dialysis, knowing what to expect can help you get comfortable with your new treatment routine More Home Hemodialysis ​ Home hemodialysis (HHD) is the modality of hemodialysis done in the home. More Peritoneal Dialysis Peritoneal dialysis (PD) is currently the most common home dialysis treatment option. More Staff-Assisted Hemodialysis​ Dialysis Care Center Staff Assisted Home Hemodialysis (SAHHD) is a patient-focused program More In-Center Hemodialysis ​ You have many dialysis treatments options, one of which is in-center hemodialysis. More Treatments",
    "source": "treatments",
    "chunk_id": "treatments_chunk_1",
    "word_count": 88,
    "char_count": 617
  },
  {
    "text": "Home Hemodialysis Home hemodialysis (HHD) refers to the process of conducting hemodialysis at home. The patient’s vascular access in HHD allows blood to flow through a dialysis machine. This effectively cleans the blood by removing excess waste and fluids. The cleaned blood is then simultaneously returned to the patient’s body. Traditional home hemodialysis closely resembles in-center hemodialysis. Deciding that HHD is right for you?Training on HHDTransitioning from in-center dialysis to HHD Deciding that HHD is right for you? Training on HHD Transitioning from in-center dialysis to HHD Menu Deciding that HHD is right for you? Training on HHD Transitioning from in-center dialysis to HHD Deciding that HHD is right for you? When you have an end-stage renal disease (ESRD), you and your nephrologist (kidney doctor) will together decide which treatment options are the best fit for your lifestyle. Ask your doctor about HHD. Patients are more inclined towards this type of dialysis treatment because: You can dialyze in your own home comfortably. Short daily home hemodialysis (HHD) allows for shorter treatment times, providing increased flexibility in scheduling. Treatment can easily be administered with the help of your care partner. Dialyzing at home enables you to maintain an active lifestyle, whether it’s at work, school, or during travel. With HHD, you may have more dietary freedom than in-center hemodialysis. You’ll save a lot of time by not traveling to a dialysis center three days a week. Care.Convenience.Freedom. DCC is proud to offer the best quality home dialysis services to its patients.Call 844-466-3436 Training on HHD After you and your doctor have concluded that home hemodialysis (HHD) suits your needs and you have found a nearby Dialysis program, an HHD nurse will guide you through a customized training program that addresses your specific medical and learning requirements. This comprehensive program will equip you with the necessary knowledge, resources, and assistance to maintain your health and safety while enjoying the numerous advantages of the HHD. Your nurse will personalize the training program to suit your needs. Patients will get to learn about these insightful topics: Using your equipment Creating a hygienic environment Manage supplies Handling needles Keeping an organized log of your treatments Most of the training sessions are held at our Dialysis centers. People who choose the HHD will have a dialysis care partner to assist them every step of the way. Care partners Most home hemodialysis (HHD) patients require a care partner (trained caregiver) to assist them during dialysis. The responsibilities of a care partner may include setting up the dialysis machine, monitoring the treatment, and cleaning the machine after dialysis sessions. The role of a care partner varies depending on the patient’s specific needs. Care partners undergo the same training as patients to ensure they can provide appropriate assistance. Self-cannulation Self-cannulation refers to the patient taking the initiative to insert their own dialysis needles. In the case of home hemodialysis (HHD), patients undergo training to learn how to perform self-cannulation, or they can have their care partners assist them with",
    "source": "treatments_home-hemodialysis",
    "chunk_id": "treatments_home-hemodialysis_chunk_1",
    "word_count": 500,
    "char_count": 3261
  },
  {
    "text": "as patients to ensure they can provide appropriate assistance. Self-cannulation Self-cannulation refers to the patient taking the initiative to insert their own dialysis needles. In the case of home hemodialysis (HHD), patients undergo training to learn how to perform self-cannulation, or they can have their care partners assist them with the needle insertion process. Although the idea of self-cannulation may initially appear intimidating, introducing techniques like the buttonhole technique has dramatically simplified and enhanced the comfort of self-cannulation. Some patients use the buttonhole for dialysis, which involves inserting needles into the same spot repeatedly, resulting in scar tissue formation and the creation of a hole similar to a pierced ear. With this method, patients can use blunt needles instead of sharp needles, which are more comfortable and safer. Training on HHD After you and your doctor have concluded that home hemodialysis (HHD) suits your needs and you have found a nearby Dialysis program, an HHD nurse will guide you through a customized training program that addresses your specific medical and learning requirements. This comprehensive program will equip you with the necessary knowledge, resources, and assistance to maintain your health and safety while enjoying the numerous advantages of the HHD. Your nurse will personalize the training program to suit your needs. Patients will get to learn about these insightful topics: Using your equipment Creating a hygienic environment Manage supplies Handling needles Keeping an organized log of your treatments Most of the training sessions are held at our Dialysis centers. People who choose the HHD will have a dialysis care partner to assist them every step of the way. Care partners Most home hemodialysis (HHD) patients require a care partner (trained caregiver) to assist them during the dialysis process.Responsibilities of a care partner may include setting up the dialysis machine, monitoring the treatment, and cleaning the machine after dialysis sessions.The role of a care partner varies depending on the specific needs of the patient.Care partners undergo the same training as patients to ensure they are equipped to provide appropriate assistance. Self-cannulation Self-cannulation refers to the patient taking the initiative to insert their own dialysis needles. In the case of home hemodialysis (HHD), patients undergo training to learn how to perform self-cannulation, or they can have their care partners assist them with the needle insertion process. Although the idea of self-cannulation may initially appear intimidating, the introduction of techniques like the buttonhole technique has greatly simplified and enhanced the comfort of self-cannulation.Some patients use the buttonhole for dialysis which involves inserting needles into the same spot repeatedly, resulting in scar tissue formation and the creation of a hole similar to a pierced ear.With this method, patients can use blunt needles instead of sharp needles, which are more comfortable and safer for the patient. Transitioning from in-center dialysis to HHD Many people who start with in-center hemodialysis eventually switch to home dialysis therapy. With home dialysis, you gain more freedom and flexibility while having a dedicated and highly trained clinical team just a phone",
    "source": "treatments_home-hemodialysis",
    "chunk_id": "treatments_home-hemodialysis_chunk_2",
    "word_count": 500,
    "char_count": 3357
  },
  {
    "text": "needles, which are more comfortable and safer for the patient. Transitioning from in-center dialysis to HHD Many people who start with in-center hemodialysis eventually switch to home dialysis therapy. With home dialysis, you gain more freedom and flexibility while having a dedicated and highly trained clinical team just a phone call away. They aim to deliver excellent care and make your experience as comfortable as possible. Transitioning from in-center dialysis to HHD Many people who start with in-center hemodialysis eventually switch to home dialysis therapy. With home dialysis, you gain more freedom and flexibility while having a dedicated and highly trained clinical team just a phone call away. They aim to deliver excellent care and make your experience as comfortable as possible. Home Hemodialysis",
    "source": "treatments_home-hemodialysis",
    "chunk_id": "treatments_home-hemodialysis_chunk_3",
    "word_count": 124,
    "char_count": 814
  },
  {
    "text": "In-Center Hemodialysis You have various options for dialysis treatment, including in-center hemodialysis.During this treatment, you are taken care of by a personalized care team at the specialized dialysis care center for three 4-hour sessions a week. People prefer this dialysis treatment method because: Trained kidney care providers monitor dialysis treatments.Patients at the dialysis center can engage in social interactions with both fellow patients and staff members.Dialysis is only three times a week, leaving four days of freedom in between.After talking with a nephrologist, many individuals prefer going to a dialysis center for treatment because it aligns well with their lifestyle. How does in-center hemodialysis work?How can I spend my time while I am at the Dialysis Center?Who is responsible for my care while I am at the dialysis center?Is there a dialysis center near me? How does in-center hemodialysis work? How can I spend my time while I am at the Dialysis Center? Who is responsible for my care while I am at the dialysis center? Is there a dialysis center near me? Menu How does in-center hemodialysis work? How can I spend my time while I am at the Dialysis Center? Who is responsible for my care while I am at the dialysis center? Is there a dialysis center near me? How does in-center hemodialysis work? Once you arrive at the dialysis center, a healthcare team comprising nurses and facility administrators will handle all aspects of your treatment. A patient care technician (PCT) will initially wash your access area.Once your access area is cleaned, your weight will be measured, and you will be escorted to your designated dialysis chair. Before connecting you to the dialysis machine, your standing and sitting blood pressure will be measured, and a dialysis nurse will assess your vital signs. The usual dialysis session takes about four hours. While you are receiving dialysis treatment, the care team closely monitors your blood pressure and the performance of the dialysis machine. After your treatment, they will disconnect you from the machine and re-record your vital signs. How can I spend my time while I am at the Dialysis Center? During your dialysis session, you can easily engage in various time-passing activities such as reading, watching television, working, using your laptop, conversing with fellow patients and care team members, or even taking a nap. These activities can be enjoyed while comfortably seated in the dialysis chair. Dialysis care center also offers free Wi-Fi for people who want to be Online, stream a video, or chat with friends. Who is responsible for my care while I am at the dialysis center? You spend a significant amount of time and put a lot of trust in the caregivers who take care of your well-being. A supportive kidney healthcare team can enhance your overall experience and make it more pleasant. In-center Dialysis offers dedicated care and support from a team of highly skilled dialysis caregivers who are dedicated to improving your quality of life. Is there a dialysis center near me?",
    "source": "treatments_in-center-hemodialysis",
    "chunk_id": "treatments_in-center-hemodialysis_chunk_1",
    "word_count": 500,
    "char_count": 3072
  },
  {
    "text": "care of your well-being. A supportive kidney healthcare team can enhance your overall experience and make it more pleasant. In-center Dialysis offers dedicated care and support from a team of highly skilled dialysis caregivers who are dedicated to improving your quality of life. Is there a dialysis center near me? Dialysis Care Center has several outpatient dialysis centers located throughout the United States.As one of the largest independent providers of dialysis services in the United States, there will be a Dialysis Care Center near your home or work. Talk to our admission specialist at 844-466-3436 or you can search for a center nearby. In-Center Hemodialysis",
    "source": "treatments_in-center-hemodialysis",
    "chunk_id": "treatments_in-center-hemodialysis_chunk_2",
    "word_count": 105,
    "char_count": 672
  },
  {
    "text": "Dialysis Care Center About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Admissions Find A Center Find A Center Search Search Close this search box. Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Menu Pay My Bill About DCC Mission and Values The DCC Story Leadership DCC Cares Explore Events Treatments Starting on Dialysis In-Center Hemodialysis Staff-Assisted Dialysis Peritoneal Dialysis Home Hemodialysis Living with Dialysis Diet and Nutrition Blog Feature Stories Careers Explore jobs in USA Peritoneal Dialysis Peritoneal dialysis, or PD, is currently the most common home dialysis treatment option. Among nephrologists (kidney doctors) worldwide, it is considered the most recommended initial and long-term therapy. PD is generally performed every day, either manually during the day or at night, with the help of a cycler machine. How PD worksTransitionary from in-center dialysis to PDCommon Questions of Peritoneal Dialysis (PD)Benefits of Peritoneal Dialysis How PD works Transitioning from in-center dialysis to PD Common Questions of Peritoneal Dialysis (PD) Benefits of Peritoneal Dialysis Menu How PD works Transitioning from in-center dialysis to PD Common Questions of Peritoneal Dialysis (PD) Benefits of Peritoneal Dialysis How PD worksWhen the kidneys cannot filter out toxins and fluid buildup in the body, the person will undergo dialysis treatment to remove waste materials from the body. PD uses your own abdomen (belly) lining to help remove the waste buildup. This is done with a solution known as dialysate. Instead of using needles, a surgically placed tube called a catheter is used to pass dialysate in and out of the abdomen. This soft and flexible catheter, approximately the width of a pencil, can be discreetly hidden under clothing while going about daily activities. The process involves the fluid drawing waste from the blood and exiting the body through the catheter over several hours. Since peritoneal dialysis (PD) treatments can be performed multiple times a day, it closely resembles the natural function of the kidneys. The catheter remains permanently in the abdomen and is secured outside the body with tape, allowing individuals to continue their everyday tasks such as work recreation, taking a shower, sexual activity, and exercise without interference. Transitioning from in-center dialysis to PDMany people starting with an in-center dialysis treatment might eventually switch to at-home dialysis treatment. You will have more freedom and flexibility during your dialysis treatment but will certainly not be alone.You will be just one phone call away",
    "source": "treatments_peritoneal-dialysis",
    "chunk_id": "treatments_peritoneal-dialysis_chunk_1",
    "word_count": 500,
    "char_count": 3375
  },
  {
    "text": "sexual activity, and exercise without interference. Transitioning from in-center dialysis to PDMany people starting with an in-center dialysis treatment might eventually switch to at-home dialysis treatment. You will have more freedom and flexibility during your dialysis treatment but will certainly not be alone.You will be just one phone call away from our highly trained home dialysis clinical team members, who will dedicated to providing you with superior care and will make your dialysis experience as smooth as it can get.Our on-call nurse is available 24/7, as is vendor support for your PD cycler.To see if PD can be a suitable option for you, talk to your nephrologist or a care team member. To learn more about PD, read about the Benefits of Peritoneal Dialysis. Care.Convenience.Freedom. DCC is proud to offer the best quality home dialysis services to its patients.Call 844-466-3436 Common Questions of Peritoneal Dialysis (PD) Infections are more common with PD compared to other modality choices. If you have an infection, it can be treated at home with antibiotics. You are also more likely to get a kidney transplant in the U.S. than to be at risk of peritonitis infection. PD is very time-consuming. PD may allow you to spend time with family and friends, at work, or do what you love the most – because, with this option, you can have dialysis treatment outside of a dialysis center. PD is not a viable option for individuals who are overweight, muscular, or tall. PD is mostly suited for patients with a larger body mass. Studies show that death and infection rates are similar for people with end-stage renal disease (ESRD) who have a raised body mass and are on PD than those on in-center hemodialysis (HD). PD is not suitable for people who have disabilities. Although PD may be more challenging for people with specific disabilities (blindness, deafness, amputation, etc.), this treatment may still be an option. Performing PD with the help of a care partner and/or specialized equipment is often feasible. Training and safety programs are available to provide education on safely and effectively performing treatments for the patient and their care partner. PD is not an option for older people. There are no age limitations for undergoing PD. Older individuals, as well as children, may be able to perform PD with the assistance of a care partner. People on PD can’t own pets. Pets cannot be in the room while performing PD, but you can still have them. Maintaining cleanliness in your home and the designated treatment area during PD is essential. Benefits of Peritoneal Dialysis PD gives you more control over your treatment and allows for a flexible schedule. You can administer your PD treatment yourself. PD can be done overnight using a machine (cycler) or manually during the day. The PD equipment can be conveniently delivered to your home. You do not require needles for PD. PD allows you to pursue your interests more freely. With PD, you’ll have fewer trips to the dialysis center",
    "source": "treatments_peritoneal-dialysis",
    "chunk_id": "treatments_peritoneal-dialysis_chunk_2",
    "word_count": 500,
    "char_count": 3018
  },
  {
    "text": "PD can be done overnight using a machine (cycler) or manually during the day. The PD equipment can be conveniently delivered to your home. You do not require needles for PD. PD allows you to pursue your interests more freely. With PD, you’ll have fewer trips to the dialysis center since it is done at home. PD may have fewer dietary restrictions, which can make you feel better. Potential for a greater feeling of well-being There is less time needed for recovery between PD treatments. Dialysis Care Center AL AK AZ AR CA CO CT DE FL GA HI ID IL IN IA KS KY LA ME MD MA MI MN MS MO MT NE NV NH NJ NM NY NC ND OH OK OR PA RI SC SD TN TX UT VT VA WA WV WI WY DC Explore LocationsServicesDCC CaresEventsNews Useful Links CareersMy DCCPartnersContact UsBlogsPay My Bill DCC Customer Care Center 708-713-5080 Useful Links Locations | Services | DCC Care | Careers | Contact Us Admissions 844-466-3436 309-808-4352 admissions@dccdialysis.com​ Admissions: 844-466-3436 309-808-4352 admissions@dccdialysis.com​ This site is for informational purposes only and is not intended to be a substitute for professional medical advice, diagnosis or treatment.© 2025. DIALYSIS CARE CENTER. ALL RIGHTS RESERVED #LeadingwithCare Chair-time schedule guaranteed within 2 hours Talk to our admissions specialist Call 844-466-3436 or email us at admissions@dccdialysis.com​",
    "source": "treatments_peritoneal-dialysis",
    "chunk_id": "treatments_peritoneal-dialysis_chunk_3",
    "word_count": 223,
    "char_count": 1352
  },
  {
    "text": "Staff-Assisted Hemodialysis The Dialysis Care Center Staff-Assisted Dialysis program is designed to prioritize patients’ needs by offering them the opportunity to receive dialysis treatment in the comfort of their homes, given they meet specific eligibility requirements. The main difference between Staff Assisted Home Hemodialysis (SAHHD) and Home Hemodialysis (HHD) is that SAHHD doesn’t require patients to have someone like a Care Partner, Friend, or Family Member present during their treatments. What is Staff-Assisted Home Dialysis​?Who Performs Your Treatment?Who Supports You?What Your Dialysis Schedule Looks Like? What is Staff-Assisted Home Dialysis? Who Performs Your Treatment? Who Supports You? What Your Dialysis Schedule Looks Like? Menu What is Staff-Assisted Home Dialysis? Who Performs Your Treatment? Who Supports You? What Your Dialysis Schedule Looks Like? What is Staff-Assisted Dialysis? When deciding between staff-assisted home dialysis and home dialysis treatment, it is crucial to consider the variations and distinctions between the two options. Before deciding on the optimal dialysis option for you, it is essential to consider the lifestyle you desire carefully. Care.Convenience.Freedom. DCC is proud to offer the best quality home dialysis services to its patients.Call 844-466-3436 Who Performs Your Treatment? The main difference between staff-assisted dialysis and home dialysis is who performs the treatment. With staff-assisted home dialysis, someone else helps you with the treatment. However, with home dialysis, you will need to learn to do the treatment yourself eventually. Initially, you will receive training from a medical professional on administering the treatment. The training will also include advice about keeping records of your treatment. After completing the necessary training, you will be responsible for conducting the dialysis treatment on your own in the case of home dialysis. On the other hand, with staff-assisted home dialysis, you won’t need to perform the treatment by yourself.Instead, a licensed nurse will do it for you every visit. The trained DCC Professional will complete all treatments.There are a lot of benefits to Staff Assisted Home Hemodialysis (SAHHD):Treatment is done in your homeNo care partner is neededSchedule is flexible1 on 1 treatment with a trained professionalFewer diet restrictionNo travel is required Who Supports You? During home dialysis, it will be your responsibility to manage your treatments, but you will also need to choose a care partner who can provide support throughout the process. A care partner is typically someone like a spouse, family member, or close friend.When you choose home dialysis, you will need to have a care partner, usually a spouse, family member, or close friend, to support you during the treatment. While having someone by your side can be comforting, it also means depending on someone else for your care, which might make you feel guilty. However, you don’t need a care partner with staff-assisted home dialysis. A licensed nurse will administer your treatment and provide the necessary support, ensuring you are always under the supervision of a doctor. You can always have your family continue to support you, but you won’t need to take up as much of their time. What Your Dialysis",
    "source": "treatments_staff-assisted-dialysis",
    "chunk_id": "treatments_staff-assisted-dialysis_chunk_1",
    "word_count": 500,
    "char_count": 3316
  },
  {
    "text": "staff-assisted home dialysis. A licensed nurse will administer your treatment and provide the necessary support, ensuring you are always under the supervision of a doctor. You can always have your family continue to support you, but you won’t need to take up as much of their time. What Your Dialysis Schedule Looks Like? One significant difference between home dialysis treatment and staff-assisted home dialysis is the flexibility of the treatment schedule. With home dialysis, you may need to perform the dialysis even when you’re not feeling well, which can increase the risk of mistakes or unwanted side effects.In contrast, you won’t be personally responsible for the treatment with staff-assisted home dialysis.This means you can undergo dialysis even if you’re tired, as your nurse will handle the process, relieving you of any concerns or worries. Staff-Assisted Dialysis",
    "source": "treatments_staff-assisted-dialysis",
    "chunk_id": "treatments_staff-assisted-dialysis_chunk_2",
    "word_count": 136,
    "char_count": 880
  },
  {
    "text": "Starting on Dialysis Knowing what to expect helps you feel more comfortable with your new treatment routine when getting ready for dialysis. Before starting dialysis, your doctor will explain the different treatment options to you, and you can choose the one that works best for you and your lifestyle. Your care team will be there with you every step of the way, providing guidance and support during the planning, training, and learning process of dialysis, helping you to adapt and do well. What is DIalysis?Choosing the dialysis optionFrequently asked questions What is Dialysis? Choosing the dialysis option Frequently asked questions Menu What is Dialysis? Choosing the dialysis option Frequently asked questions What is Dialysis? Dialysis is generally started when your kidney function drops to 15% or less or if you have severe symptoms caused by your kidney disease. Shortness of breath, fatigue, muscle cramps, nausea, or vomiting are severe symptoms that may occur. When your kidneys cannot remove extra fluid and waste from the body, then dialysis is generally recommended.Your nephrologist will assist you in determining the appropriate time to begin dialysis, considering factors such as your remaining kidney function as determined by tests and your symptoms. It is advised to start preparing for dialysis well ahead of time, typically when your kidney disease progresses to stage 4, where the glomerular filtration rate (GFR) falls below 30 mL/min. Chronic Kidney Disease (CKD) often progresses slowly. Often, individuals are unaware of the extent of their discomfort until they commence dialysis, which can lead to a significant improvement in how they feel. To improve your well-being, it is crucial to adhere to the treatment plan recommended by your healthcare team, including doctors, nurses, dietitians, and social workers. Following their guidance can help you maintain the healthiest lifestyle possible. Choosing the dialysis option Selecting a dialysis option that suits your current way of life can enable you to continue enjoying the activities you love while keeping your health in check. Home peritoneal dialysis, home hemodialysis, or in-center dialysis are viable choices for most individuals. Making an early decision allows for more preparation time and can contribute to a greater sense of control over your health. In-center hemodialysis With in-center hemodialysis (HD), you’ll typically go to the dialysis center thrice per week for about 3 to 5 hours per session to have your blood filtered, depending on your doctor’s schedule. Throughout your treatment, a needle will be used to connect you to an artificial kidney (dialyzer) through your access site. Your healthcare team will closely monitor and oversee the entire dialysis process, ensuring that you have all the necessary support and resources you require. Home hemodialysis With home hemodialysis (HD), you are connected via a needle in your access site to an artificial kidney (dialyzer) that filters your blood. Opting for home-based treatment gives you the flexibility to schedule your prescribed treatments according to your daily activities. Treating at home eliminates the need to travel to a treatment center, saving travel time and transportation",
    "source": "treatments_starting-on-dialysis",
    "chunk_id": "treatments_starting-on-dialysis_chunk_1",
    "word_count": 500,
    "char_count": 3249
  },
  {
    "text": "a needle in your access site to an artificial kidney (dialyzer) that filters your blood. Opting for home-based treatment gives you the flexibility to schedule your prescribed treatments according to your daily activities. Treating at home eliminates the need to travel to a treatment center, saving travel time and transportation expenses. Peritoneal dialysis Home peritoneal dialysis (PD) involves using the peritoneum and the lining of your abdomen to filter your blood. Unlike other forms of dialysis, PD does not require needles, and your blood remains inside your body throughout the process. One of the advantages of PD is its flexibility, allowing you to perform treatments in various settings such as your home, workplace, or even while traveling. Initiating PD at an early stage may contribute to preserving any remaining kidney function. Frequently asked questions Who pays for dialysis? Private insurance usually covers dialysis and other treatment for kidney failure. If you don’t have private insurance, most people who need dialysis or a transplant can qualify for Medicare, even under 65 years old. Different plans cover dialysis, like HMOs, Healthcare exchanges, Medicaid, and programs from the state or local government. Contact our admissions specialist at 844-466-3436 to help you find programs and determine coverage. Do I have to control what I eat when I'm on dialysis? Diet is based on your health requirements determined by your doctor and dietitian.Although dialysis slightly reduces some diet restrictions, people on this type of therapy need to follow an eating plan regulated by their healthcare professionals. Learn more Will I have fluid restrictions when I'm on dialysis? Fluid intake is reduced when patients with chronic kidney disease are on dialysis. Too much fluid can cause lasting adverse effects like high blood pressure, shortness of breath, and heart damage. Discuss with your physician how much water you can drink each day. Learn more Can dialysis patients travel? Patients on dialysis can travel. The portable systems use a peritoneal dialysis cycler or home hemodialysis machine. Patients can arrange for their dialysis supplies to be shipped in advance to their travel destination, and the dialysis machines can easily pass through airport security. In the case of in-center dialysis, treatment coordinators at the dialysis center can assist in locating a clinic near the travel destination and scheduling appointments for the patient during their trip. Learn more Can I keep working if I'm on dialysis? Peritoneal dialysis and home hemodialysis treatments can be conducted according to your schedule at home, allowing you to continue working without much difficulty. If you are undergoing in-center dialysis, you can inform the center about your work commitments, and together, you can arrange a treatment schedule that accommodates your working hours. Learn more Will I be able to continue hobbies and have a normal life on dialysis? Absolutely. Individuals on dialysis can continue to engage in their hobbies, participate in their communities, spend time with friends, and even exercise. Your healthcare team will work in collaboration with you to ensure that you can maintain as",
    "source": "treatments_starting-on-dialysis",
    "chunk_id": "treatments_starting-on-dialysis_chunk_2",
    "word_count": 500,
    "char_count": 3228
  },
  {
    "text": "be able to continue hobbies and have a normal life on dialysis? Absolutely. Individuals on dialysis can continue to engage in their hobbies, participate in their communities, spend time with friends, and even exercise. Your healthcare team will work in collaboration with you to ensure that you can maintain as normal a life as possible while undergoing dialysis. Can I be on dialysis forever? Yes. Patients can remain on dialysis for a lifetime and enjoy a good quality of life. Do I have to stay on the same type of dialysis? While it’s true that you may require dialysis for the rest of your life unless you receive a transplant, it’s essential to know that the type of dialysis you choose initially can potentially be modified in the future under your doctor’s supervision.Whatever treatment option you choose, you will have a team of doctors, nurses, social workers, dietitians, and technicians to help care for you during your treatment. Healthcare professionals will help you manage all aspects of your disease and treatment. The team will answer your questions and ensure you have a smooth and stress-free experience Learn more options about in-center, peritoneal, and home hemodialysis. Starting on Dialysis",
    "source": "treatments_starting-on-dialysis",
    "chunk_id": "treatments_starting-on-dialysis_chunk_3",
    "word_count": 198,
    "char_count": 1216
  }
]